namespace Luotao.Lib.Books.ICS7._03._02
{
    /// <summary>
    ///     3.2. Identifiers
    /// </summary>
    public static class C01
    {
        public static int Fn01()
        {
            //----------------------------------------------------------------------------------------------------
            // 标识符（identifier）可以以 @ 开头
            //----------------------------------------------------------------------------------------------------
            var i01 = 6;

            return i01;
        }
    }
}
