namespace LT.LIB.BOOK.ICS7._04._10
{
    /// <summary>
    /// static typing and the dynamic keyword
    /// </summary>
    public static class C10
    {
        public static int Fn01()
        {
            //----------------------------------------------------------------------------------------------------
            // dynamic 类型的变量，在编译时期不会进行类型检查，而是在运行时期检查，
            // 如果运行时期检查到类型不匹配，则会抛出异常，
            //----------------------------------------------------------------------------------------------------
            dynamic i = "0";

            return i;
        }
    }
}
