using Xunit;

namespace LuotaoYeah.Test.Books.ICS7._03._07
{
    public class C0502
    {
        [Fact]
        public void _01()
        {
            //----------------------------------------------------------------------------------------------------
            // format 中用一个字符表示格式，C# 内置了多种格式，
            // 格式后面用 1/2 数字表示精度，
            //----------------------------------------------------------------------------------------------------

            var i01 = 12.345678;
            Assert.Equal("12.35", $"{i01:F2}"); // 四舍五入
            Assert.Equal("0000000F", $"{15:X8}"); // 
        }
    }
}
