namespace Luotao.Lib.Books.ICS7._08._04
{
    /// <summary>
    ///     8.4 masking members of a base class
    /// </summary>
    public class C01
    {
        public int I01 = 6;

        public int Fn01(int x)
        {
            return x + 1;
        }
    }

    public class C02 : C01
    {
        //----------------------------------------------------------------------------------------------------
        // 子类的 field 和父类的 field 如果同名，父类的 field 被隐藏，
        //----------------------------------------------------------------------------------------------------
        public new const string I01 = "8";

        //----------------------------------------------------------------------------------------------------
        // 子类的 method 和父类的 method 如果签名相同，父类的 method 被隐藏，
        //----------------------------------------------------------------------------------------------------
        public new int Fn01(int x)
        {
            return x + 2;
        }
    }
}
