namespace LuotaoYeah.Lib.Books.ICS7._12._01._01
{
    //----------------------------------------------------------------------------------------------------
    // enum 的 member 的默认类型为 int，我们可以显式设置为其他的类型，
    // enum 的 member 的值默认为从 0 递增，我们可以显式设置某个（某些）member 的值，
    // 此时，未设值的 member 的值为上一个 member 的值加一，
    //----------------------------------------------------------------------------------------------------
    public enum TrafficLight
    {
        Green,
        Yellow = 3,
        Red
    }
}
