namespace LuotaoYeah.Lib.Books.ICS7._11._04._01
{
    //----------------------------------------------------------------------------------------------------
    // struct 默认都会隐式地定义一个 parameterless constructor，这个 parameterless constructor 不能被删除/修改，
    // 因此我们只能定义有参数的 constructor，
    //----------------------------------------------------------------------------------------------------
    public struct Simple
    {
        public int X;
        public int Y;

        //----------------------------------------------------------------------------------------------------
        // constructor 中必须对所有的 instance field 进行初始化，
        //----------------------------------------------------------------------------------------------------
        public Simple(int x, int y)
        {
            X = x;
            Y = y;
        }
    }
}
