using Xunit;

namespace Luotao.Test.Books.ICS7._06._17
{
    public class C01
    {
        [Fact]
        public void _01()
        {
            //----------------------------------------------------------------------------------------------------
            // ref local 类似于 C++ 里面的 reference，是一个变量的别名，
            //----------------------------------------------------------------------------------------------------

            var i01 = 6;
            ref var ref01 = ref i01;
            Assert.Equal(6, i01);
            Assert.Equal(6, ref01);

            ref01 = 8;
            Assert.Equal(8, i01);
            Assert.Equal(8, ref01);

            i01 = 9;
            Assert.Equal(9, i01);
            Assert.Equal(9, ref01);
        }

        [Fact]
        public void _02()
        {
            //----------------------------------------------------------------------------------------------------
            // 使用 ref return 初始化一个 ref local
            //----------------------------------------------------------------------------------------------------
            var c01 = new Lib.Books.ICS7._06._17.C01();
            ref var i01 = ref c01.Fn01();
            Assert.Equal(8, i01);

            c01.I01 = 9;
            Assert.Equal(9, i01);
        }

        [Fact]
        public void _03()
        {
            //----------------------------------------------------------------------------------------------------
            // ref return 也可以当成 value 来使用，
            //----------------------------------------------------------------------------------------------------
            var c01 = new Lib.Books.ICS7._06._17.C01();
            var i01 = c01.Fn01();
            Assert.Equal(8, i01);

            c01.I01 = 9;
            Assert.Equal(8, i01);
        }
    }
}
